RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/dm-firmware/SblOspi/sbl_ospi_stage1/sbl_ospi_stage1_e4_a1.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM62Px" --part "Default" --package "AMH" --context "wkup-r5fss0-0" --product "MCU-PLUS-SDK-AM62P@11.02.00"
 * @v2CliArgs --device "AM62P" --package "FCBGA (AMH)" --variant "AM62P54-M" --context "wkup-r5fss0-0" --product "MCU-PLUS-SDK-AM62P@11.02.00"
 * @versions {"tool":"1.24.2+4234"}
 */

/**
 * Import the modules used in this configuration.
 */
const flash       = scripting.addModule("/board/flash/flash", {}, false);
const flash1      = flash.addInstance();
const bootloader  = scripting.addModule("/drivers/bootloader/bootloader", {}, false);
const bootloader1 = bootloader.addInstance();
const bootloader2 = bootloader.addInstance();
const bootloader3 = bootloader.addInstance();
const bootloader4 = bootloader.addInstance();
const ddr         = scripting.addModule("/drivers/ddr/ddr", {}, false);
const ddr1        = ddr.addInstance();
const gtc         = scripting.addModule("/drivers/gtc/gtc");
const mcu_bist    = scripting.addModule("/drivers/mcu_bist/mcu_bist", {}, false);
const mcu_bist1   = mcu_bist.addInstance();
const qos         = scripting.addModule("/drivers/qos/qos", {}, false);
const qos1        = qos.addInstance();
const clock       = scripting.addModule("/kernel/dpl/clock");
const debug_log   = scripting.addModule("/kernel/dpl/debug_log");
const mpu_armv7   = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71  = mpu_armv7.addInstance();
const mpu_armv72  = mpu_armv7.addInstance();
const mpu_armv73  = mpu_armv7.addInstance();
const mpu_armv74  = mpu_armv7.addInstance();
const mpu_armv75  = mpu_armv7.addInstance();
const mpu_armv76  = mpu_armv7.addInstance();
const mpu_armv77  = mpu_armv7.addInstance();
const mpu_armv78  = mpu_armv7.addInstance();
const mpu_armv79  = mpu_armv7.addInstance();
const mpu_armv710 = mpu_armv7.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
bootloader1.appImageOffset = "0x80000";
bootloader1.bootloaderDma  = true;
bootloader1.$name          = "CONFIG_BOOTLOADER_SBL_STAGE2_A";

bootloader2.bootloaderDma  = true;
bootloader2.appImageOffset = "0x180000";
bootloader2.$name          = "CONFIG_BOOTLOADER_SBL_STAGE2_B";

bootloader3.bootloaderDma  = true;
bootloader3.appImageOffset = "0x280000";
bootloader3.$name          = "CONFIG_BOOTLOADER_SBL_STAGE2_RECOVERY_A";

bootloader4.bootloaderDma  = true;
bootloader4.appImageOffset = "0x380000";
bootloader4.$name          = "CONFIG_BOOTLOADER_SBL_STAGE2_RECOVERY_B";

bootloader1.flashDriver                                  = flash1;
flash1.$name                                             = "CONFIG_FLASH_SBL";
bootloader2.flashDriver                                  = flash1;
bootloader3.flashDriver                                  = flash1;
bootloader4.flashDriver                                  = flash1;
flash1.serialFlashDriver.$name                           = "board_flash_serialFlash_serialflash0";
flash1.serialFlashDriver.device                          = "CUSTOM_FLASH";
flash1.serialFlashDriver.fname                           = "mx25uv125";
flash1.serialFlashDriver.flashSize                       = 16777216;
flash1.serialFlashDriver.flashManfId                     = "0xC2";
flash1.serialFlashDriver.flashDeviceId                   = "0x8138";
flash1.serialFlashDriver.flashBlockSize                  = 65536;
flash1.serialFlashDriver.cmdBlockErase3B                 = "0xD8";
flash1.serialFlashDriver.cmdSectorErase3B                = "0x20";
flash1.serialFlashDriver.strDtr_cfgReg                   = "0x0";
flash1.serialFlashDriver.strDtr_cmdRegRd                 = "0x71";
flash1.serialFlashDriver.strDtr_cmdRegWr                 = "0x72";
flash1.serialFlashDriver.strDtr_shift                    = 0;
flash1.serialFlashDriver.dummyClksRd                     = 16;
flash1.serialFlashDriver.proto_cfgReg                    = "0x0";
flash1.serialFlashDriver.proto_cmdRegRd                  = "0x71";
flash1.serialFlashDriver.proto_cmdRegWr                  = "0x72";
flash1.serialFlashDriver.proto_mask                      = "0x03";
flash1.serialFlashDriver.proto_bitP                      = 2;
flash1.serialFlashDriver.dummy_cfgReg                    = "0x300";
flash1.serialFlashDriver.dummy_cmdRegRd                  = "0x71";
flash1.serialFlashDriver.dummy_cmdRegWr                  = "0x72";
flash1.serialFlashDriver.dummy_mask                      = "0x7";
flash1.serialFlashDriver.dummy_bitP                      = 2;
flash1.serialFlashDriver.strDtr_mask                     = "0x3";
flash1.serialFlashDriver.strDtr_bitP                     = 2;
flash1.serialFlashDriver.dummyId8                        = 4;
flash1.serialFlashDriver.xspiWipRdCmd                    = "0x05";
flash1.serialFlashDriver.xspiWipReg                      = "0x00000000";
flash1.serialFlashDriver.flashDeviceBusyTimeout          = 40000000;
flash1.serialFlashDriver.addressByteSupport              = "2";
flash1.serialFlashDriver.fourByteEnableSeq               = "0x20";
flash1.serialFlashDriver.cmdExtType                      = "INVERSE";
flash1.serialFlashDriver.dummyClksCmd                    = 4;
flash1.serialFlashDriver.quirks                          = "";
flash1.serialFlashDriver.bootQuirks                      = "";
flash1.serialFlashDriver.peripheralDriver.$name          = "CONFIG_OSPI_SBL";
flash1.serialFlashDriver.peripheralDriver.dmaEnable      = true;
flash1.serialFlashDriver.peripheralDriver.phyEnable      = true;
flash1.serialFlashDriver.peripheralDriver.fastBootTuning = "true";

ddr1.$name = "CONFIG_DDR0";

mcu_bist1.$name = "CONFIG_MCU_BIST0";

qos1.$name = "CONFIG_QOS0";

const udma                                           = scripting.addModule("/drivers/udma/udma", {}, false);
const udma1                                          = udma.addInstance({}, false);
udma1.$name                                          = "CONFIG_UDMA0";
bootloader1.udmaDriver                               = udma1;
bootloader2.udmaDriver                               = udma1;
bootloader3.udmaDriver                               = udma1;
bootloader4.udmaDriver                               = udma1;
flash1.serialFlashDriver.peripheralDriver.udmaDriver = udma1;

const udma_blkcopy_channel                                   = scripting.addModule("/drivers/udma/udma_blkcopy_channel", {}, false);
const udma_blkcopy_channel1                                  = udma_blkcopy_channel.addInstance({}, false);
udma_blkcopy_channel1.$name                                  = "CONFIG_UDMA_BLKCOPY_CH0";
bootloader1.udmaBlkCopyChannel                               = udma_blkcopy_channel1;
bootloader2.udmaBlkCopyChannel                               = udma_blkcopy_channel1;
bootloader3.udmaBlkCopyChannel                               = udma_blkcopy_channel1;
bootloader4.udmaBlkCopyChannel                               = udma_blkcopy_channel1;
flash1.serialFlashDriver.peripheralDriver.udmaBlkCopyChannel = udma_blkcopy_channel1;

debug_log.enableCssLog                            = false;
debug_log.enableUartLog                           = true;
debug_log.sysfwUartTrace                          = true;
debug_log.uartLog.addedByBootloader               = true;
debug_log.uartLog.useWakeupDomainPeripherals      = false;
debug_log.uartLog.intrEnable                      = "DISABLE";
debug_log.uartLog.$name                           = "CONFIG_UART_SBL";
debug_log.sysfwUartLog.$name                      = "CONFIG_UART_TRACE0";
debug_log.sysfwUartLog.useWakeupDomainPeripherals = false;
debug_log.sysfwUartLog.UART.$assign               = "USART1";
debug_log.sysfwUartLog.UART.RXD.$assign           = "MCASP0_AFSR";
debug_log.sysfwUartLog.UART.TXD.$assign           = "MCASP0_ACLKR";
debug_log.sysfwUartLog.UART.RTSn.$assign          = "MCASP0_AXR2";
debug_log.sysfwUartLog.UART.CTSn.$assign          = "MCASP0_AXR3";

mpu_armv71.attributes        = "Device";
mpu_armv71.allowExecute      = false;
mpu_armv71.$name             = "REGISTER_REGION";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv72.size              = 7;
mpu_armv72.$name             = "TCMA_VEC";
mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv73.baseAddr = 0x80000000;
mpu_armv73.size     = 31;
mpu_armv73.$name    = "DDR";

mpu_armv74.baseAddr   = 0x41010000;
mpu_armv74.size       = 15;
mpu_armv74.attributes = "NonCached";
mpu_armv74.$name      = "TCMB";

mpu_armv75.size       = 15;
mpu_armv75.attributes = "NonCached";
mpu_armv75.$name      = "TCMA";

mpu_armv76.baseAddr = 0x43C00000;
mpu_armv76.size     = 18;
mpu_armv76.$name    = "HSM_RAM";

mpu_armv77.baseAddr     = 0xFC40000;
mpu_armv77.size         = 8;
mpu_armv77.attributes   = "Device";
mpu_armv77.allowExecute = false;
mpu_armv77.$name        = "FSS0_OSPI0_CTRL_REG";

mpu_armv78.baseAddr     = 0x2800000;
mpu_armv78.size         = 9;
mpu_armv78.attributes   = "Device";
mpu_armv78.allowExecute = false;
mpu_armv78.$name        = "UART0_REG";

mpu_armv79.$name        = "FSS0_DAT_REG1";
mpu_armv79.baseAddr     = 0x60000000;
mpu_armv79.size         = 27;
mpu_armv79.attributes   = "Device";
mpu_armv79.allowExecute = false;

mpu_armv710.$name    = "ATCM_SOC";
mpu_armv710.baseAddr = 0x78000000;
mpu_armv710.size     = 15;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
flash1.serialFlashDriver.peripheralDriver.OSPI.$suggestSolution      = "OSPI0";
flash1.serialFlashDriver.peripheralDriver.OSPI.CLK.$suggestSolution  = "OSPI0_CLK";
flash1.serialFlashDriver.peripheralDriver.OSPI.CSn0.$suggestSolution = "OSPI0_CSn0";
flash1.serialFlashDriver.peripheralDriver.OSPI.DQS.$suggestSolution  = "OSPI0_DQS";
flash1.serialFlashDriver.peripheralDriver.OSPI.D7.$suggestSolution   = "OSPI0_D7";
flash1.serialFlashDriver.peripheralDriver.OSPI.D6.$suggestSolution   = "OSPI0_D6";
flash1.serialFlashDriver.peripheralDriver.OSPI.D5.$suggestSolution   = "OSPI0_D5";
flash1.serialFlashDriver.peripheralDriver.OSPI.D4.$suggestSolution   = "OSPI0_D4";
flash1.serialFlashDriver.peripheralDriver.OSPI.D3.$suggestSolution   = "OSPI0_D3";
flash1.serialFlashDriver.peripheralDriver.OSPI.D2.$suggestSolution   = "OSPI0_D2";
flash1.serialFlashDriver.peripheralDriver.OSPI.D1.$suggestSolution   = "OSPI0_D1";
flash1.serialFlashDriver.peripheralDriver.OSPI.D0.$suggestSolution   = "OSPI0_D0";
debug_log.uartLog.UART.$suggestSolution                              = "USART0";
debug_log.uartLog.UART.RXD.$suggestSolution                          = "UART0_RXD";
debug_log.uartLog.UART.TXD.$suggestSolution                          = "UART0_TXD";
